Public Attributes | List of all members
API_WorkingUnitPrefs Struct Reference
Project Settings
The representation of the Preferences / Units tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_LengthTypeID  | lengthUnit
The type of the length measurement unit.
API_AreaTypeID  | areaUnit
The type of the area measurement unit.
API_VolumeTypeID  | volumeUnit
The type of the volume measurement unit.
API_AngleTypeID  | angleUnit
The type of the angle measurement unit.
short  | roundInch
1, 2, 4, 8, 16, 32, 64
short  | lenDecimals
Number of decimals for length measurement unit. (0..4)
short  | areaDecimals
Number of decimals for area measurement unit. (0..4)
short  | volumeDecimals
Number of decimals for volume measurement unit. (0..4)
short  | angleDecimals
Number of decimals for angle measurement unit. (0..4)
short  | angleAccuracy
0..4
Detailed Description
The representation of the Preferences / Units tab page.
See also
ACAPI_ProjectSetting_GetPreferences, ACAPI_ProjectSetting_SetPreferences
Remarks
This structure is used by the ACAPI_ProjectSetting_GetPreferences function to get the settings of the unit preferences page.
Member Data Documentation
◆ angleAccuracy
 API_WorkingUnitPrefs::angleAccuracy
0..4
◆ angleDecimals
 API_WorkingUnitPrefs::angleDecimals
Number of decimals for angle measurement unit. (0..4)
◆ angleUnit
 API_WorkingUnitPrefs::angleUnit
The type of the angle measurement unit.
◆ areaDecimals
 API_WorkingUnitPrefs::areaDecimals
Number of decimals for area measurement unit. (0..4)
◆ areaUnit
 API_WorkingUnitPrefs::areaUnit
The type of the area measurement unit.
◆ lenDecimals
 API_WorkingUnitPrefs::lenDecimals
Number of decimals for length measurement unit. (0..4)
◆ lengthUnit
 API_WorkingUnitPrefs::lengthUnit
The type of the length measurement unit.
◆ roundInch
 API_WorkingUnitPrefs::roundInch
1, 2, 4, 8, 16, 32, 64
◆ volumeDecimals
 API_WorkingUnitPrefs::volumeDecimals
Number of decimals for volume measurement unit. (0..4)
◆ volumeUnit
 API_WorkingUnitPrefs::volumeUnit
The type of the volume measurement unit.